package com.xml;

/**
 * 描述
 *
 * @author yangk
 * @version 1.0
 * @since 2021/10/27 10:40:57
 */
public class RegTest
{
    public static void main(String agrs[]) throws Exception
    {
       String reg1 = "(?2S\\A.0,10000?<!超无高低绝机秘A-D.)(密(秘)等)(0,6)级(:Hs1,6)?(機(絕[秘企业机机绝|内部工作秘)s0,6)密)(?5)(?<![超无高低绝机秘A-DJ)(密秘)等)5(0.6级(: Hs{1,6)?(楼(網秘企业机机绝|内部工作秘》s1(0,6)密.0.10000MZ) 补充规则:機 密,機密,機密,機 密,機密,機 密,機 密.機 密绝 密绝 密绝 密绝 密绝 密绝 密绝 密绝密秘密秘密秘密秘密秘密秘密秘密秘密机密机密机密机密机密机密机密机密絶密絶密絶密絶密絶密絶密絶密絶密密密密密密密,秘 密,秘 密,秘密·机密·绝密·秘密·機密·絶密,绝密文件,絶密文件,本报告是机密的,秘密等级,内部工作秘密";
    }
}
